// Example -Detect password spray attack across various workspaces

let timeframe = 7d;
let threshold = 3;
union
    SigninLogs
    workspace("Region-A Workspace").SigninLogs,
    workspace("Region-B Workspace").SigninLogs,
    workspace("Region-C Workspace").SigninLogs,
    workspace("Region-D Workspace").SigninLogs
| where TimeGenerated >= ago(timeframe)
| where ResultType == "50057"
| where ResultDescription =~ "User account is disabled. The account has been disabled by an administrator."
| summarize
    StartTime = min(TimeGenerated),
    EndTime = max(TimeGenerated),
    count(),
    applicationSet =
    make_set(AppDisplayName),
    ApplicationCount = dcount(AppDisplayName)
    by UserPrincipalName, IPAddress
| where ApplicationCount >= threshold